GT2/RANS/KOmegaSST_highRE_g2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

//internalField   uniform 5;
internalField   uniform 750;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    top
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }
    bottom
    {
        //type            fixedValue;
        //value           uniform 4000000;
        //value           uniform 1e-12;
        //value           $internalField;

	//Must be on - To enable wall function - Both values give right resutls
        type            omegaWallFunction;
        value           $internalField;
        //value           uniform 4000000;
    }

    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
